/*********************************************************************************************************
* 模块名称: DataType.h
* 摘    要: 数据类型定义
* 当前版本: 1.0.0
* 作    者: 
* 完成日期: 2018年03月01日 
* 内    容:
* 注    意: none                                                                  
**********************************************************************************************************
* 取代版本: 
* 作    者: 
* 完成日期: 
* 修改内容: 
* 修改文件: 
*********************************************************************************************************/
#ifndef _DATA_TYPE_H_
#define _DATA_TYPE_H_

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
typedef signed char         i8;
typedef signed short        i16;
typedef signed int          i32;
typedef unsigned char       u8;
typedef unsigned short      u16;
typedef unsigned int        u32;

typedef int                 BOOL;
typedef unsigned char       BYTE;
typedef unsigned short      HWORD;        //两个Byte组成一个HalfWord
typedef unsigned int        UWORD;         //四个Byte组成一个Word
typedef long                LONG;

#define LOHWORD(w)          ((HWORD)(w))                            //字的低半字 
#define HIHWORD(w)          ((HWORD)(((UWORD)(w) >> 16) & 0xFFFF))   //字的高半字

#define LOBYTE(hw)          ((BYTE)(hw) )                           //半字的低字节
#define HIBYTE(hw)          ((BYTE)(((UWORD)(hw) >> 8) & 0xFF))      //半字的高字节

//两个BYTE组成一个HWORD
#define MAKEHWORD(bH, bL)   ((HWORD)(((BYTE)(bL)) | ((HWORD)((BYTE)(bH))) << 8) )	

//两个HWORD组成一个WORD
#define MAKEWORD(hwH, hwL)  ((UWORD)(((HWORD)(hwL)) | ((UWORD)((HWORD)(hwH))) << 16) )

#define TRUE          1
#define FALSE         0
#define NULL          0
#define INVALID_DATA  -100

/*********************************************************************************************************
*                                              结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/

#endif
